Feature: TestSample001Feature
  Scenario: HappyPath
    Given : هيچ_نمونه_اي_از_سمپل_در_پایگاه_داده_وجود_ندارد
    When  : درخواست_درج_سمپل_بامشخصات_زير_دريافت_مي_شود
      | Text             | Age |
      | نمونه_آزمایشی    | 24  |
      | نمونه_آزمایشی_01 | 36  |
    Then : در_لیست_سمپل_هاي_سیستم_فقط_دو_رديف_زير_وجود_دارد
      | Text             | Age |
      | نمونه_آزمایشی    | 24  |
      | نمونه_آزمایشی_01 | 36  |
    And همه_ي_رديف_هاي_موجود_شناسه_دارند

  Scenario: HappyPath001
     Given  : هيچ_نمونه_ای_از_رکورد_در پايگاه_داده_وجود_ندارد
     When  : درخواست_درج_رکورد_با_مشخصات_زير_دريافت_مي_شود
      | Text          | Age   |
      | رکورد_تستی    | 66    |
      | رکورد_تست_002 | 77    |

     Then در_لیست_رکورد_ها_رديف_هاي_زير_وجود_دارد
       | Text          | Age   |
       | رکورد_تستی    | 66    |
       | رکورد_تست_002 | 77    |

